<script setup>
import ContainerWrapper from '../Components/ContainerWrapper.vue';
</script>

<template>
    <Head title="- О Компании" />

    <ContainerWrapper class="company">
        <div>
            <h2>О Компании</h2>

            <div class="company-info">
                <h1>Описание компании:</h1>

                <p>
                    <img :src="'/storage/images/advertising/company.png'" alt="">
                    CHAFFER — это современная платформа объявлений, созданная для 
                    упрощения процесса покупки и продажи товаров и услуг. Мы стремимся 
                    сделать рынок более доступным и открытым, предоставляя пользователям 
                    удобный инструмент для общения, обмена и торговли. Наша платформа 
                    объединяет людей с различными интересами и потребностями, позволяя 
                    находить нужные вещи на одной площадке.
                </p>

                <h1 class="company-info">Цель Компании</h1>

                <p>
                    Наша цель — стать ведущей платформой объявлений, которая не только облегчает 
                    процесс торговли, но и создает безопасную и надежную среду для взаимодействия 
                    между пользователями. Мы стремимся предложить интуитивно понятный интерфейс, 
                    защиту транзакций и механизмы для разрешения споров, чтобы каждый пользователь 
                    чувствовал себя уверенно при использовании нашей платформы.
                </p>
            </div>
        </div>

        <div>
            <h1>Миссия Компании</h1>

            <p>
                Миссия CHAFFER заключается в том, чтобы сделать мир торговли доступным и 
                безопасным. Мы верим, что каждый человек должен иметь возможность легко 
                находить и предлагать товары и услуги, не беспокоясь о проблемах и рисках, 
                связанных с торговлей. Мы стремимся создать сообщество, где покупатели и продавцы 
                могут взаимодействовать, делиться опытом и помогать друг другу.
            </p>
        </div>

        <div>
            <h1>Персонал Компании</h1>

            <p>
                <img :src="'/storage/images/advertising/staff.jpeg'" alt="">
                Персонал CHAFFER — это команда профессионалов, увлеченных своей работой и 
                стремящихся предоставлять пользователям лучший сервис. Каждый член нашей 
                команды обладает уникальными навыками и опирается на свои знания для 
                обеспечения высококачественного обслуживания клиентов.
            </p>

            <ul>
                <li>
                    Команда поддержки: Наши сотрудники поддержки всегда готовы помочь пользователям 
                    с любыми вопросами или проблемами. Мы понимаем, что качество обслуживания — это 
                    ключевой элемент успешного бизнеса.
                </li>
                <li>   
                    Разработчики: Наша команда разработчиков постоянно работает над улучшением 
                    платформы, интеграцией новых функций и обеспечением безопасности пользователей. 
                    Они следят за последними трендами в технологиях, чтобы CHAFFER всегда 
                    оставалось на переднем крае.
                </li>

                <li>
                    Маркетологи и менеджеры: Они отвечают за разработку стратегий продвижения, 
                    чтобы привлечь новых пользователей и создать сообщество вокруг нашей платформы. 
                    Их работа заключается в том, чтобы делать платформу более заметной и доступной 
                    для широкой аудитории.
                </li>
            </ul>

            <p>
                Мы уверены, что успешная компания — это не только качественный продукт, но и команда, 
                сплоченная общей целью. Мы гордимся тем, что наши сотрудники работают с энтузиазмом 
                и стремлением к высоким результатам, и именно это отличает AdVenture от других 
                платформ объявления. Присоединяйтесь к нам, и давайте вместе сделаем мир торговли 
                проще и доступнее!
            </p>
        </div>
    </ContainerWrapper>
</template>

<style scoped lang="scss">
.company {
    display: flex;
    flex-direction: column;
    gap: 40px;

    img {
        width: 700px;
        float: right;
    }

    h2 {
        font-size: 36px;
        font-weight: 600;
        margin-bottom: 20px;
    }

    h1 {
        font-size: 28px;
        font-weight: 600;
        margin-bottom: 10px;
    }

    p {
        font-size: 24px;
        font-weight: 400;
        text-indent: 50px;
    }

    ul {
        font-size: 24px;
        font-weight: 400;

        padding-left: 40px;
        padding-top: 10px;
        padding-bottom: 10px;
    }

    li {
        padding-top: 10px;
    }

    
    @media only screen and (max-width: 480px) {
        gap: 20px;

        h2 {
            font-size: 28px;
            font-weight: 600;
            margin-bottom: 10px;
        }

        h1 {
            font-size: 22px;
            font-weight: 600;
            margin-bottom: 10px;
        }

        p {
            font-size: 18px;
            font-weight: 400;
            text-indent: 0;
        }

        ul {
            font-size: 18px;
            font-weight: 400;

            padding-left: 20px;
            padding-top: 10px;
            padding-bottom: 10px;
        }
    }
}

.company-info {
    h1 {
        margin-top: 40px;
    }
    
    @media only screen and (max-width: 480px) {
        h1 {
            margin-top: 10px;
        }
    }
}
</style>