<script setup>
import ContainerWrapper from '../Components/ContainerWrapper.vue';
</script>

<template>
    <Head title="- Информация" />

    <ContainerWrapper class="company">
        <div>
            <h2>Информация для клиента</h2>

            <p>
                Добро пожаловать на наш сайт объявлений! Мы стремимся предоставить вам 
                максимальный комфорт и безопасность в процессе размещения и поиска объявлений. 
                Ниже вы найдете важную информацию, которая поможет вам лучше ориентироваться 
                в нашем сервисе. Как разместить объявление?
            </p>

            <div class="company-info">
                <h1>Регистрация:</h1>

                <p>
                    Для начала вам нужно зарегистрироваться на сайте. Это позволит вам управлять 
                    своими объявлениями и получать уведомления.
                </p>

                <h1 class="company-info">Создание объявления: </h1>

                <p>
                    Заполните форму для создания нового объявления. Укажите заголовок, описание, 
                    цену и добавьте фотографии, если необходимо.
                </p>
            </div>
        </div>

        <div>
            <h1>Публикация:</h1>

            <p>
                Проверьте правильность введенной информации и нажмите кнопку "Опубликовать". 
                Ваше объявление сразу станет доступно для просмотра.
            </p>
        </div>

        <div>
            <h1>Поиск по категориям:</h1>

            <p>
                Используйте фильтры для быстрого поиска по категориям. Наш сайт предлагает 
                широкий выбор категорий – от недвижимости до автомобилей.
            </p>
        </div>
        
        <div>
            <h1>Поиск по ключевым словам:</h1>

            <p>
                Введите интересующие вас термины в строку поиска, чтобы быстро найти необходимые 
                предложения.
            </p>
        </div>
        
        <div>
            <h1>Проверяйте контактную информацию:</h1>

            <p>
                Прежде чем связываться с продавцом, убедитесь, что контактные данные указаны правильно.
            </p>
        </div>
        
        <div>
            <h1>Лично встречайтесь:</h1>

            <p>
                Мы рекомендуем, по возможности, проводить встречи в общественных местах и 
                избегать предварительной оплаты.
            </p>
        </div>
        
        <div>
            <h1>Часто задаваемые вопросы</h1>

            <p>
                Если у вас возникли вопросы или вы хотите узнать больше о процессе размещения 
                и покупки объявлений, посетите раздел "Часто задаваемые вопросы" на нашем сайте. 
                Мы подготовили ответы на самые распространенные запросы.
            </p>

            <p>
                В случае возникновения вопросов или проблем, не стесняйтесь обращаться в нашу 
                службу поддержки. Мы всегда готовы помочь вам! Спасибо, что выбрали наш сайт 
                объявлений! Мы надеемся, что ваш опыт будет приятным и успешным.
            </p>
        </div>
    </ContainerWrapper>
</template>

<style scoped lang="scss">
.company {
    display: flex;
    flex-direction: column;
    gap: 40px;

    img {
        width: 700px;
        float: right;
    }

    h2 {
        font-size: 36px;
        font-weight: 600;
        margin-bottom: 20px;
    }

    h1 {
        font-size: 28px;
        font-weight: 600;
        margin-bottom: 10px;
    }

    p {
        font-size: 24px;
        font-weight: 400;
        text-indent: 50px;
    }

    ul {
        font-size: 24px;
        font-weight: 400;

        padding-left: 40px;
        padding-top: 10px;
        padding-bottom: 10px;
    }

    li {
        padding-top: 10px;
    }

    @media only screen and (max-width: 480px) {
        gap: 20px;

        h2 {
            font-size: 28px;
            font-weight: 600;
            margin-bottom: 10px;
        }

        h1 {
            font-size: 22px;
            font-weight: 600;
            margin-bottom: 10px;
        }

        p {
            font-size: 18px;
            font-weight: 400;
            text-indent: 0;
        }

        ul {
            font-size: 18px;
            font-weight: 400;

            padding-left: 20px;
            padding-top: 10px;
            padding-bottom: 10px;
        }
    }
}

.company-info {
    h1 {
        margin-top: 40px;
    }
}
</style>